DeviceEvents
| where (ActionType=="UsbDriveMounted" or (ActionType == "FileCreated" and InitiatingProcessAccountName != "system" and FolderPath !startswith "C:\\" and FolderPath !startswith "\\" and Timestamp >= datetime(2024-08-15) and Timestamp <= datetime(2024-12-15)))
| extend ParsedFields=parse_json(AdditionalFields)
| project DeviceId, ActionType, DriveLetter=iff(ActionType == "UsbDriveMounted", ParsedFields.DriveLetter, ""), MountTime=iff(ActionType == "UsbDriveMounted", Timestamp, datetime(null)), 
  ProductName=iff(ActionType == "UsbDriveMounted", ParsedFields.ProductName, ""), SerialNumber=iff(ActionType == "UsbDriveMounted", ParsedFields.SerialNumber, ""), Manufacturer=iff(ActionType == "UsbDriveMounted", ParsedFields.Manufacturer, ""),
  InitiatingProcessAccountDomain, InitiatingProcessAccountName, InitiatingProcessAccountUpn, FileName, FolderPath, SHA256, SensitivityLabel, IsAzureInfoProtectionApplied, Timestamp, ReportId
| order by DeviceId asc, Timestamp desc
| project ReportId, DeviceId, ActionType, DriveLetter, MountTime, ProductName, SerialNumber, Manufacturer, InitiatingProcessAccountDomain, InitiatingProcessAccountName, InitiatingProcessAccountUpn, FileName, FolderPath, SHA256, SensitivityLabel, IsAzureInfoProtectionApplied, Timestamp
